ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_uds.c
/******************************************************************************
* Function Name: Cy_BLE_UDSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t - A finction result state if it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATTS_ERR_PROCEDURE_ALREADY_IN_PROGRESS
*   * CY_BLE_GATTS_ERR_CCCD_IMPROPERLY_CONFIGURED
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_UDSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    if(Cy_BLE_UDS_ApplCallback != NULL)
    {
        cy_stc_ble_uds_char_value_t locCharValue;
        locCharValue.connHandle = eventParam->connHandle;
        locCharValue.gattErrorCode = CY_BLE_GATT_ERR_NONE;

        if((eventParam->handleValPair.attrHandle ==
            cy_ble_udsConfigPtr->udss->charInfo[CY_BLE_UDS_DCI].descrHandle[CY_BLE_UDS_CCCD]) ||
           (eventParam->handleValPair.attrHandle ==
            cy_ble_udsConfigPtr->udss->charInfo[CY_BLE_UDS_UCP].descrHandle[CY_BLE_UDS_CCCD]))
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };

            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
            locCharValue.value = NULL;
            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                uint32_t eventCode;

                if(eventParam->handleValPair.attrHandle == cy_ble_udsConfigPtr->udss->charInfo[CY_BLE_UDS_DCI].
                    descrHandle[CY_BLE_UDS_CCCD])
                {
                    locCharValue.charIndex = CY_BLE_UDS_DCI;

                    if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                    {
                        eventCode = (uint32_t)CY_BLE_EVT_UDSS_NOTIFICATION_ENABLED;
                    }
                    else
                    {
                        eventCode = (uint32_t)CY_BLE_EVT_UDSS_NOTIFICATION_DISABLED;
                    }
                }
                else
                {
                    locCharValue.charIndex = CY_BLE_UDS_UCP;

                    if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                    {
                        eventCode = (uint32_t)CY_BLE_EVT_UDSS_INDICATION_ENABLED;
                    }
                    else
                    {
                        eventCode = (uint32_t)CY_BLE_EVT_UDSS_INDICATION_DISABLED;
                    }
                }

                Cy_BLE_UDS_ApplCallback(eventCode, &locCharValue);
            }

        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            /* Set flag to store bonding data to flash */
            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
            {
                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
            }
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            for(locCharValue.charIndex = CY_BLE_UDS_FNM;
                locCharValue.charIndex < CY_BLE_UDS_CHAR_COUNT;
                locCharValue.charIndex++)
            {
                if(eventParam->handleValPair.attrHandle ==
                   cy_ble_udsConfigPtr->udss->charInfo[locCharValue.charIndex].charHandle)
                {
                    gattErr = Cy_BLE_GATT_DbCheckPermission(eventParam->handleValPair.attrHandle,
                                                            &eventParam->connHandle, CY_BLE_GATT_DB_WRITE |
                                                            CY_BLE_GATT_DB_PEER_INITIATED);

                    if((gattErr == CY_BLE_GATT_ERR_NONE) && (locCharValue.charIndex == CY_BLE_UDS_UCP))
                    {
                        if(CY_BLE_UDS_IS_PROCEDURE_IN_PROGRESS)
                        {
                            gattErr = CY_BLE_GATT_ERR_PROCEDURE_ALREADY_IN_PROGRESS;
                        }
                        else if(!CY_BLE_IS_INDICATION_ENABLED(eventParam->connHandle.attId,
                                                              cy_ble_udsConfigPtr->udss->charInfo[CY_BLE_UDS_UCP].
                                                               descrHandle[CY_BLE_UDS_CCCD]))
                        {
                            gattErr = CY_BLE_GATT_ERR_CCCD_IMPROPERLY_CONFIGURED;
                        }
                        else
                        {
                        }
                    }

                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        locCharValue.value = &eventParam->handleValPair.value;

                        if(!CY_BLE_GATT_DB_ATTR_CHECK_PRPTY(eventParam->handleValPair.attrHandle,
                                                            CY_BLE_GATT_DB_CH_PROP_WRITE))
                        {
                            gattErr = CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED;
                        }
                        else if(eventParam->handleValPair.value.len >
                                CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(eventParam->handleValPair.attrHandle))
                        {
                            gattErr = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                        }
                        else
                        {
                            Cy_BLE_UDS_ApplCallback((uint32_t)CY_BLE_EVT_UDSS_WRITE_CHAR, &locCharValue);

                            if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_USER_DATA_ACCESS_NOT_PERMITTED)
                            {
                                gattErr = CY_BLE_GATT_ERR_USER_DATA_ACCESS_NOT_PERMITTED;
                            }
                            else
                            {
                                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                                {
                                    .handleValuePair = eventParam->handleValPair,
                                    .connHandle      = eventParam->connHandle,
                                    .offset          = 0u,
                                    .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                                };

                                gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                                if(gattErr == CY_BLE_GATT_ERR_NONE)
                                {
                                    CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_udsConfigPtr->udss->
                                                                          charInfo[locCharValue.charIndex].charHandle,
                                                                         locCharValue.value->len);

                                    if(locCharValue.charIndex == CY_BLE_UDS_UCP)
                                    {
                                        cy_ble_udsFlag |= CY_BLE_UDS_FLAG_PROCESS;
                                    }
                                }
                            }
                        }
                    }
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    break;
                }
            }
        }
    }

    return(gattErr);
}

